#include <stdio.h>

/*
指针和二维数组
参考苏小红C程序设计PPT
*/

int main()
{
    int a[2][3] = {{1, 2, 3}, {4, 5, 6}};
    int (*p)[3]; //该数组指针表示行数组的指针，存放了3个元素
    //&a[0][0]等于a[0],&a[0]等于a
    p = a; //a表示a[0]的地址
 
    //遍历方法1：只使用数组指针(行指针)。由于二维数组在内存中也是按顺序存储，第二行的首元素在第一行首元素后面
    for (int i = 0; i < 2; i++)
    {
        for (int j = 0; j < 3; j++)
        {
            printf("%d\n", *(*(p + i) + j));
        }
    }

    //遍历方法2：使用数组指针(行指针)和列指针
    for (; p != a + 2; p++)
    {
        //p表示a[0]的地址，因此*p表示a[0]={1, 2, 3}，因此q就指向行数组首元素的地址
        for (int *q = *p; q != *p + 3; q++)
        {
            printf("%d\n", *q);
        }
    }
}
